# WorksetConfiguration Constructor (WorksetConfiguration)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetConfiguration Constructor (WorksetConfiguration)
WorksetConfiguration Class See Also
---
Constructs a new copy of the input WorksetConfiguration object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public WorksetConfiguration(
	WorksetConfiguration other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As WorksetConfiguration _
)
```

Visual C++
---
```text
public:
WorksetConfiguration(
	WorksetConfiguration^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..WorksetConfiguration
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
WorksetConfiguration Class
WorksetConfiguration Overload
Autodesk.Revit.DB Namespace